**free

DCL-PR ccsidConvert INT(10);
  input POINTER CONST;
  inputLength UNS(10) CONST;
  inputCcsid INT(10) CONST;
  output POINTER CONST;
  outputLength UNS(10);
  outputCcsid INT(10) CONST;
END-PR;
