**free

DCL-PR ccsidConvert INT(10);
  input POINTER CONST;
  inputLength INT(10) CONST;
  inputCcsid CHAR(5) CONST;
  output POINTER;
  outputLength INT(10);
  outputCcsid CHAR(5) CONST;
END-PR;
