**free

DCL-PR ccsidConvert INT(10);
  input POINTER;
  inputLength UNS(10);
  inputCcsid INT(10) CONST;
  output POINTER;
  outputLength UNS(10);
  outputCcsid INT(10) CONST;
END-PR;
